<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    //测试用户账号： 13667938568 密码： 123456
    // 'account_info' => [
    //     'username' => 'admin',
    //     'userpass' => 'niuniu@@888',
    //     'role_id'  => 1,
    // ],

    'fault' => [
        'range' => [
            10   => '单条推广链接',
            9   => '单个代理/渠道商用户',
            8   => '用户访问',
            7   => '用户支付',
            6   => '阅读记录',
            5   => '主域名',
            4   => '充值数据',
            3   => '分成数据',
            2   => '以上均有影响',
            1   => '其他',
        ],
        'source' => [
            4   => '人为',
            3   => '服务商(服务器，域名等)',
            2   => '用户(代理商，渠道商等)',
            1   => '其他',
        ],
        'isRenovate' => [
            0   => '未解决',
            1   => '已解决',
        ],
    ],

    'problem' => [
        'source' => [
            8   => '支付充值',
            7   => '阅读记录',
            6   => '阅读扣币',
            5   => '访问异常',
            4   => '跳转异常',
            3   => '用户阅读',
            2   => '用户签到',
            1   => '其他',
        ],
        'group' => [
            1   => '商务',
            2   => '客服',
            3   => '财务',
        ],
    ],

    'domain' => [
        'product' => [
            1   => '牛牛推_万能追书',
            2   => '牛牛推_内涵书城',
            3   => '暴走看书',
        ],
        'type' => [
            1   => '落地域名',
            2   => '作品推广域名',
            3   => '主域名',
            4   => '关注回复域名',
            5   => '黑名单域名',
            6   => 'VIP域名',
            7   => '菜单域名',
        ],
        'status' => [
            1   => '正常',
            2   => '被封',
            3   => '备用',
            4   => '解封',
        ],
    ],

    'user'  => [
        'role'  => [
            1   => 'admin',
            2   => 'user',
        ],
    ],

    'interface_domain' => 'http://www.niuniutui.com/',
];